app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        // Load cookie helper for set_cookie() and get_cookie()
        helper('cookie');

        $session = session();
        $mode = $arguments[0] ?? 'auth';

        if ($mode === 'noauth') {
            if ($session->get('isLoggedIn')) {
                return redirect()->to('/dashboard');
            }
        } else {
            if (!$session->get('isLoggedIn')) {
                return redirect()->to('/login')->with('error', 'Please log in first.');
            }

            // ✅ CHECK SESSION VERSION - Force logout if ROLE changed in database
            $userModel = new UserModel();
            $userId = $session->get('user_id');
            $sessionVersion = $session->get('session_version') ?? 1;

            $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'