app/Controllers/Admin.php

SELECT *
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_restricted` = 1
---
    public function manageUsers()
    {
        if ($redirect = $this->secureAdmin()) return $redirect;

        $userModel = new UserModel();
        $search = $this->request->getGet('search');

        if ($search) {
            // Search by ID, Name, or Email
            $users = $userModel->groupStart()
                               ->like('id', $search)
                               ->orLike('name', $search)
                               ->orLike('email', $search)
                               ->groupEnd()
                               ->findAll();
        } else {
            $users = $userModel->findAll();
        }

        $data = [
            'users' => $users,
            'restricted_count' => $userModel->where('is_restricted', 1)->countAllResults(),

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function editUser($id)
    {
        if ($redirect = $this->secureAdmin()) return $redirect;

        $userModel = new UserModel();
        $user = $userModel->find($id);