app/Controllers/Auth.php

    public function loginPost()
    {
        $session = session();
        $model = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Authentication//
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'keyan@gmail.com'
 LIMIT 1

    public function dashboard()
    {
        $session = session();

        // Authorization check - ensure user is logged in
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Please log in to access the dashboard.');
        }

        $role = $session->get('role');
        $name = $session->get('name');
        $userId = $session->get('user_id');

        // Validate role exists
        if (empty($role)) {
            session()->destroy();
            return redirect()->to('/login')->with('error', 'Invalid session. Please log in again.');
        }

        $data = [
            'name' => $name,
            'role' => $role
        ];


        // Role-based data loading from database
        if ($role === 'admin') {
            $userModel = new UserModel();
            $data['total_users'] = $userModel->countAll();
            $data['restricted_users'] = $userModel->where('is_restricted', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_restricted` = 0