app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('lipo', 'lipo@gmail.com', '$2y$10$rFgdZ.ImszHZEFc.lOqB1O/g86qy7SeBKQ2k5ph.4R8aAPSQWkV5y', 'user', '2025-10-02 00:41:10', '2025-10-02 00:41:10')
---
    public function create()
    {
        helper(['form']);
        $users = new UserModel();

        $data = [
            'name'         => $this->request->getPost('name'),
            'email'        => $this->request->getPost('email'),
            'password'     => $this->request->getPost('password'),
            'pass_confirm' => $this->request->getPost('pass_confirm'),
            'role'         => 'student',  // ← FIXED: Changed from 'user' to 'student'
        ];

        if (!$users->save($data)) {

SELECT *
FROM `users`
WHERE `email` = 'lipo@gmail.com'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $users   = new UserModel();

        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $users->where('email', $email)->first();